In [14]:
import csv, sqlite3

In [15]:
conn = sqlite3.connect("database.db")
conn.text_factory = str
cur = conn.cursor()
cur.execute("CREATE TABLE IF NOT EXISTS weather (zip INT, coord_lon FLOAT, coord_lat FLOAT, weather VARCHAR(20), weather_description VARCHAR(50), temp FLOAT, temp_min FLOAT, temp_max FLOAT, pressure INT, humidity INT, wind_speed FLOAT, city VARCHAR)")

In [16]:
import pandas as pd 

weather = pd.read_csv("weather_data.csv")
weather.to_sql('weather', conn, if_exists='replace', index = False, chunksize=100000)

In [20]:
cur.execute("DROP TABLE realtor")

In [22]:
cur.execute("CREATE TABLE IF NOT EXISTS realtor (prop_type VARCHAR(30), city VARCHAR(30), postal_code INT, lat FLOAT, lon FLOAT, size INT, price FLOAT)")

In [23]:
import os 
files = os.listdir("output")

for file in files: 
    path = os.path.join("output", file)
    df = pd.read_csv(path)
    df = df.rename(columns={"size (sqft)": "size"})
    df.to_sql('realtor', conn, if_exists='append', index = False)

In [24]:
df = pd.read_sql("SELECT * FROM realtor LIMIT 100", con=conn)
df

,prop_type,city,postal_code,lat,lon,size,price
0,single_family,Worcester,1602.0,42.294006,-71.861004,2912.0,610000.0
1,single_family,Worcester,1602.0,42.264029,-71.831773,1831.0,299900.0
2,condo,Worcester,1602.0,42.258662,-71.838505,1188.0,259900.0
3,single_family,Worcester,1602.0,42.270983,-71.819560,2096.0,469000.0
4,single_family,Worcester,1602.0,42.284980,-71.874311,2852.0,319900.0
...,...,...,...,...,...,...,...
95,single_family,Rochester,14617.0,43.245391,-77.599747,1404.0,189900.0
96,single_family,Rochester,14617.0,43.245926,-77.601536,1561.0,159900.0
97,single_family,Rochester,14617.0,43.214811,-77.596465,1656.0,175000.0
98,single_family,Rochester,14617.0,43.213660,-77.602627,1247.0,150000.0
99,land,Rochester,NaN,43.219321,-77.583973,NaN,24900.0